{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.14.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "LAYER_0", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_0", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_1", "inbound_nodes": [[["LAYER_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "LAYER_2", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_2", "inbound_nodes": [[["LAYER_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_3", "inbound_nodes": [[["LAYER_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "LAYER_4", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_4", "inbound_nodes": [[["LAYER_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_5", "inbound_nodes": [[["LAYER_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "LAYER_6", "trainable": true, "dtype": "float32", "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_6", "inbound_nodes": [[["LAYER_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_7", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_7", "inbound_nodes": [[["LAYER_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "LAYER_8", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LAYER_8", "inbound_nodes": [[["LAYER_7", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["LAYER_8", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "LAYER_0/kernel", "shape": [36, 200], "dtype": "float32"}, {"name": "LAYER_0/bias", "shape": [200], "dtype": "float32"}, {"name": "LAYER_2/kernel", "shape": [200, 200], "dtype": "float32"}, {"name": "LAYER_2/bias", "shape": [200], "dtype": "float32"}, {"name": "LAYER_4/kernel", "shape": [200, 200], "dtype": "float32"}, {"name": "LAYER_4/bias", "shape": [200], "dtype": "float32"}, {"name": "LAYER_6/kernel", "shape": [200, 200], "dtype": "float32"}, {"name": "LAYER_6/bias", "shape": [200], "dtype": "float32"}, {"name": "LAYER_8/kernel", "shape": [200, 8], "dtype": "float32"}, {"name": "LAYER_8/bias", "shape": [8], "dtype": "float32"}]}]}
